 
 gcc -g p6final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x722: file p6final.c, line 9.
(gdb) l
1   #include <stdio.h>
2
3
4   void input(char *a, char *b);
5   int compare(char *a, char *b);
6   void output(char *a, char *b, int ans);
7
8   int main()
9   {
10    char a[20], b[20];
(gdb) r
Starting program: /home/runner/pps-IA1-practice-3/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p6final.c:9
9   {
(gdb) n
13    input(a, b);
(gdb) n
Enter a string a: hello
Enter a string b: world
14    ans = compare(a, b);
(gdb) n
15    output(a, b, ans);
(gdb) n
world is greater than hello
17    return 0;
(gdb) s
18  }
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 105) exited normally]
(gdb) l
13    input(a, b);
14    ans = compare(a, b);
15    output(a, b, ans);
16
17    return 0;
18  }
19
20  void input(char *a, char *b)
21  {
22      printf("Enter a string a: ");
(gdb)